import random
import math

# ------------------------------------------------------------------------------
# 1 Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

# Пример:

# - 6 -> да
# - 7 -> да
# - 1 -> нет

# listDay = ['Monday', 'Tuesday', 'Wednesday',
#            'Thursday', 'Friday', 'Saturday', 'Sunday']
# day = int(input())
# if day >= 1 and (day < 8):
#     if day >= 6:
#         print(f'{listDay[day-1]}  -> YES it''s weekend')
#     else:
#         print(f'{listDay[day-1]}  -> NO it''s weekday'
# else:
#     print('NOT correct input number')


# ------------------------------------------------------------------------------
# Напишите программу для. проверки истинности утверждения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.


# X = random.choice([True, False])
# Y = random.choice([True, False])
# Z = random.choice([True, False])
# print(X, Y, Z)
# print((not(X or Y or Z)))
# print(((not X) and (not Y) and (not Z)))
# print((not(X or Y or Z)) == ((not X) and (not Y) and (not Z)))


# ------------------------------------------------------------------------------
# Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка (или на какой оси она находится).

# Пример:

# - x=34; y=-30 -> 4
# - x=2; y=4-> 1
# - x=-34; y=-30 -> 3

# print('Введите Х: ', end=' ')
# X = int(input())
# print('Введите Y: ', end=' ')
# Y = int(input())

# if X == 0 and Y == 0:
#     print('Not correct input numbers')

# else:
#     if X == 0:
#         print(f'X-{X}, Y-{Y} -> точка находится на оси Х')
#     elif Y == 0:
#         print(f'X-{X}, Y-{Y} -> точка находится на оси Х')
#     elif X > 0 and Y > 0:
#         print(f'X-{X}, Y-{Y} -> точка находится в первой четвети')
#     elif X < 0 and Y > 0:
#         print(f'X-{X}, Y-{Y} -> точка находится во второй четвети')
#     elif X > 0 and Y < 0:
#         print(f'X-{X}, Y-{Y} -> точка находится в четвертой четвети')
#     elif X < 0 and Y < 0:
#         print(f'X-{X}, Y-{Y} -> точка находится в третьей четвети')

# ------------------------------------------------------------------------------
# Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y).


# print('Введите номер четвети: ', end=' ')
# dot = int(input())
# if dot > 0 and dot < 5:
#     if dot == 1:
#         print('X => 0 -> +∞   и Y => 0 -> +∞ ')
#     elif dot == 2:
#         print(' -∞ <- X < 0 и Y => 0 -> +∞ 0')
#     elif dot == 3:
#         print('-∞ <- X < 0 и -∞ <- Y < 0')
#     else :
#         print('X => 0 -> +∞ 0 и -∞ <- Y < 0')
# else :
#     print('Неверный ввод четверти')


# ------------------------------------------------------------------------------
# Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.

# Пример:

# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21

# def  pow(x,y):
#     if y == 0:
#         return 1
#     i = x
#     for _ in range(1,y) :
#       i *=x
#     return i

# print("Введите координаты точки А: ")
# A = [int(input()),int(input())]
# print("Введите координаты точки B: ")
# B = [int(input()),int(input())]
# result = str(round((math.sqrt(pow(B[0]-A[0],2)+pow(B[1]-A[1],2))),3))
# print(result[:-1])
